ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syspm/cy_syspm.h
/*******************************************************************************
*       Register Constants
*******************************************************************************/

/**
* \addtogroup group_syspm_macro
* \{
*/

/** Driver major version */
#define CY_SYSPM_DRV_VERSION_MAJOR       1

/** Driver minor version */
#define CY_SYSPM_DRV_VERSION_MINOR       0

/** \cond INTERNAL */

/** Internal define for SysPm_DeepSleep() function */
#define CY_SYSPM_PWR_TRIM_WAKE_CNTS                      (0x8Bu)

/** Internal define for Cy_SysPm_ExitLpMode() function */
#define CY_SYSPM_WAIT_DELAY_TRYES                        (100u)

/** Internal define for SysPm_SwitchToSimoBuck() function */
#define CY_SYSPM_1M_THRESHOLD                            (1000000u)

/** Internal define for SysPm_WakeupPinLevel() function */
#define CY_SYSPM_PWR_MASK_HIBPIN_PIN_MASK                (0x03u)

/** Internal define for SysPm_WakeupPinLevel() function */
#define CY_SYSPM_WAKEUP_PIN_BIT                          (1ul)

/* Internal define for Cy_SysPm_WakeupLpCompLevel() function */
#define CY_SYSPM_LPCOMPARATOR_BIT                        (4ul)

/* Define for mask for LPComs in Cy_SysPm_WakeupLpCompLevel() function */
#define CY_SYSPM_LPCOMPARATOR_MASK                       (12u)

/** \endcond */

/** syspm driver identifier */
#define CY_SYSPM_ID                                      (CY_PDL_DRV_ID(0x10u))

/**
* \defgroup group_syspm_return_status Power Mode Status
* \{
* Current power mode status defines
*/

/** CM4 is Active */
#define CY_SYSPM_STATUS_CM4_ACTIVE       (0x01u)

/** CM4 is in Sleep */
#define CY_SYSPM_STATUS_CM4_SLEEP        (0x02u)

/** CM4 is in DeepSleep */
#define CY_SYSPM_STATUS_CM4_DEEPSLEEP    (0x04u)

/** CM4 is Lop Power mode */
#define CY_SYSPM_STATUS_CM4_LOWPOWER     (0x80u)

/** CM0 is Active */
#define CY_SYSPM_STATUS_CM0_ACTIVE       ((uint32_t) ((uint32_t)0x01u << 8u))

/** CM0 is in Sleep */
#define CY_SYSPM_STATUS_CM0_SLEEP        ((uint32_t) ((uint32_t)0x02u << 8u))

/** CM0 is in DeepSleep */
#define CY_SYSPM_STATUS_CM0_DEEPSLEEP    ((uint32_t) ((uint32_t)0x04u << 8u))

/** CM4 is in Low Power mode */
#define CY_SYSPM_STATUS_CM0_LOWPOWER     ((uint32_t) ((uint32_t)0x80u << 8u))

/** Device is in Low Power mode*/
#define CY_SYSPM_STATUS_SYSTEM_LOWPOWER  ((uint32_t) (CY_SYSPM_STATUS_CM0_LOWPOWER | (CY_SYSPM_STATUS_CM4_LOWPOWER)))

/** \} group_syspm_return_status */

/** Define to update token to indicate Hibernate mode transition */
#define CY_SYSPM_PWR_HIBERNATE_TOKEN_HIBERNATE              (0xf1u)

/** Wait time for transition device from Active into the LPActive */
#define CY_SYSPM_PWR_ACTIVE_TO_LP_WAIT_US                   (1u)

/** Wait time for transition device from Active into the LPActive before Active
* reference is settled
*/
#define CY_SYSPM_PWR_LP_TO_ACTIVE_WAIT_BEFORE_US    (8u)

/** Wait time for transition device from Active into the LPActive after Active
* reference is settled
*/
#define CY_SYSPM_PWR_LP_TO_ACTIVE_WAIT_AFTER_US    (1u)

/** Maximum callbacks number */
#define CY_SYSPM_PWR_MAX_CALLBACKS_NUMBER         (32u)

/** Mask to unlock Hibernate mode */
#define CY_SYSPM_PWR_HIBERNATE_UNLOCK             ((uint32_t) 0x3Au << SRSS_PWR_HIBERNATE_UNLOCK_Pos)

/** Mask to retain Hibernate status */
#define CY_SYSPM_PWR_RETAIN_HIBERNATE_STATUS      ((uint32_t) SRSS_PWR_HIBERNATE_TOKEN_Msk |\
                                                              SRSS_PWR_HIBERNATE_MASK_HIBALARM_Msk |\
                                                              SRSS_PWR_HIBERNATE_MASK_HIBWDT_Msk |\
                                                              SRSS_PWR_HIBERNATE_POLARITY_HIBPIN_Msk |\
                                                              SRSS_PWR_HIBERNATE_MASK_HIBPIN_Msk)


/** Maximum value of callbacks */
#define CY_SYSPM_PWR_MAX_PLL_NUMBER                     (16u)

/** Definition for delay of SIMO Buck supply regulator after it is enabled */
#define CY_SYSPM_SIMO_BUCK_CORE_SUPPLY_STABLE_US       (900u)

/** Definition for delay of SIMO Buck output 2 */
#define CY_SYSPM_SIMO_BUCK_BLE_SUPPLY_STABLE_US        (600u)

/** Definition for delay of Linear Regulator after it output voltage
* is changed
*/
#define CY_SYSPM_LDO_IS_STABLE_US                      (9u)

/** Definition for delay of core supply regulator after it output voltage
* is changed
*/
#define CY_SYSPM_SIMO_BUCK_IS_STABLE_US                 (200u)
/** \} group_syspm_macro */

/*******************************************************************************
*       Configuration Structures
*******************************************************************************/

/**
* \addtogroup group_syspm_data_enumerates
* \{
*/

/** This enumeration is used to initialize the wakeup pin state */
typedef enum
{
    CY_SYSPM_PIN_DISABLED,    /**< Disable selected wakeup pin */
    CY_SYSPM_PIN_HIGH_LEVEL,  /**< Configure high level for selected wakeup-pin */
    CY_SYSPM_PIN_LOW_LEVEL    /**< Configure low level for selected wakeup-pin */
} cy_en_syspm_pinstate_t;


/** This enumeration is used to initialize the Low-power Comparator
* (LPComp) state
*/
typedef enum
{
    CY_SYSPM_LPCOMP_DISABLED,    /**< Disable selected LPComp */
    CY_SYSPM_LPCOMP_HIGH_LEVEL,  /**< Configure high level for selected LPComp */
    CY_SYSPM_LPCOMP_LOW_LEVEL    /**< Configure low level for selected LPComp */
} cy_en_syspm_lpcomp_state_t;

/**
* This enumeration is used to initialize a wait action - an interrupt or
* event. Refer to the CMSIS for the WFE and WFI instruction explanations.
*/
typedef enum
{
    CY_SYSPM_WAIT_FOR_INTERRUPT,      /**< Wait for interrupt */
    CY_SYSPM_WAIT_FOR_EVENT           /**< Wait for event */
} cy_en_syspm_waitfor_t;

/**
* The enumeration for core voltages for both the SIMO Buck and the
* Linear Regulator
*/
typedef enum
{
    CY_SYSPM_LDO_VOLTAGE_0_9V = 0x05u,         /**< 0.9 V nominal core voltage */
    CY_SYSPM_LDO_VOLTAGE_1_1V = 0x17u          /**< 1.1 V nominal core voltage */
} cy_en_syspm_ldo_voltage_t;

/**
* The enumeration for core voltages for both the SIMO Buck and the
* Linear Regulator
*/
typedef enum
{
    CY_SYSPM_SIMO_BUCK_OUT1_VOLTAGE_0_9V = 0x01u,         /**< 0.9 V nominal core voltage */
    CY_SYSPM_SIMO_BUCK_OUT1_VOLTAGE_1_1V = 0x05u          /**< 1.1 V nominal core voltage */
} cy_en_syspm_simo_buck_voltage1_t;


/**
* The enumeration for core voltages for both the SIMO Buck and the
* Linear Regulator
*/
typedef enum
{
    CY_SYSPM_SIMO_BUCK_OUT2_VOLTAGE_0_95V = 0u,    /**< 0.95 V nominal core voltage */
    CY_SYSPM_SIMO_BUCK_OUT2_VOLTAGE_1_0V,          /**< 1.0 V nominal core voltage */
    CY_SYSPM_SIMO_BUCK_OUT2_VOLTAGE_1_05V,         /**< 1.05 V nominal core voltage */
    CY_SYSPM_SIMO_BUCK_OUT2_VOLTAGE_1_1V,          /**< 1.1 V nominal core voltage */
    CY_SYSPM_SIMO_BUCK_OUT2_VOLTAGE_1_2V,          /**< 1.2 V nominal core voltage */
    CY_SYSPM_SIMO_BUCK_OUT2_VOLTAGE_1_3V,          /**< 1.3 V nominal core voltage */
    CY_SYSPM_SIMO_BUCK_OUT2_VOLTAGE_1_4V,          /**< 1.4 V nominal core voltage */
    CY_SYSPM_SIMO_BUCK_OUT2_VOLTAGE_1_5V,          /**< 1.5 V nominal core voltage */
} cy_en_syspm_simo_buck_voltage2_t;

/**
* The enumeration are used to configure SIMO Buck regulator outputs
*/
typedef enum
{
    CY_SYSPM_BUCK_VBUCK_1,          /**< SIMO Buck output 1 Voltage (Vback1) */
    CY_SYSPM_BUCK_VRF               /**< SIMO Buck out 2 Voltage (Vbackrf) */
} cy_en_syspm_buck_out_t;

/** SysPm status definitions */
typedef enum
{
    CY_SYSPM_SUCCESS       = 0x00u,                                        /**< Successful */
    CY_SYSPM_BAD_PARAM     = CY_SYSPM_ID | CY_PDL_STATUS_ERROR | 0x01u,    /**< One or more invalid parameters */
    CY_SYSPM_TIMEOUT       = CY_SYSPM_ID | CY_PDL_STATUS_ERROR | 0x02u,    /**< Time-out occurs */
    CY_SYSPM_INVALID_STATE = CY_SYSPM_ID | CY_PDL_STATUS_ERROR | 0x03u,    /**< Operation not setup or is in an
                                                                                improper state */
    CY_SYSPM_FAIL          = CY_SYSPM_ID | CY_PDL_STATUS_ERROR | 0xFFu     /**< Unknown failure */
} cy_en_syspm_status_t;

/**
* This enumeration is used for selecting the low power mode on which the
* appropriate registered callback handler will be executed. For example,
* registered callback with type CY_SYSPM_SLEEP will be executed while
* switching into the Sleep power mode.
*/
typedef enum
{
    CY_SYSPM_SLEEP,         /**< Sleep enum callback type */
    CY_SYSPM_DEEPSLEEP,     /**< DeepSleep enum callback type */
    CY_SYSPM_HIBERNATE,     /**< Hibernate enum callback type */
    CY_SYSPM_ENTER_LP_MODE, /**< Enter LPActive mode enum callback type */
    CY_SYSPM_EXIT_LP_MODE,  /**< Exit LPActive mode enum callback type */
} cy_en_syspm_callback_type_t;

/** Callback mode enumeration. This enum define the callback mode */
typedef enum
{
    CY_SYSPM_CHECK_READY,       /**< Callbacks with this mode are executed before entering into low-power mode.
                                     It checks if device is ready to enter low-power mode */
    CY_SYSPM_CHECK_FAIL,        /**< Callbacks with this mode are executed after the previous callbacks execution
                                     with CY_SYSPM_CHECK_READY returned CY_SYSPM_FAIL. Callback with
                                     CY_SYSPM_CHECK_FAIL mode should rollback the actions which were done in
                                     callbacks executed previously with CY_SYSPM_CHECK_READY */
    CY_SYSPM_BEFORE_ENTER,      /**< Actions that should be done before enter low-power mode */
    CY_SYSPM_AFTER_EXIT,        /**< Actions that should be done after exit low-power mode */
} cy_en_syspm_callback_mode_t;

/** \} group_syspm_data_enumerates */

/**
* \addtogroup group_syspm_data_structures
* \{
*/

/** Type for syspm callbacks */
typedef cy_en_syspm_status_t (*Cy_SysPmCallback) (void *base, void *content, cy_en_syspm_callback_mode_t mode);

/** The structure which contain the syspm callback configuration elements */
typedef struct cy_stc_syspm_callback
{
    Cy_SysPmCallback Callback;                /**< Callback handler function */
    cy_en_syspm_callback_type_t type;         /**< Callback type, see \ref cy_en_syspm_callback_type_t */
    void *base;                               /**< Base address of HW instance, matches with driver name in
                                                   the API for base address */
    void *content;                            /**< Content for handler function */
    struct cy_stc_syspm_callback *nextItm;    /**< Next list item */
} cy_stc_syspm_callback_t;
/** \} group_syspm_data_structures */

/**
* \addtogroup group_syspm_functions
* \{
*/
__STATIC_INLINE bool Cy_SysPm_Cm4IsActive(void);
__STATIC_INLINE bool Cy_SysPm_Cm4IsSleep(void);
__STATIC_INLINE bool Cy_SysPm_Cm4IsDeepSleep(void);
__STATIC_INLINE bool Cy_SysPm_Cm4IsLowPower(void);
__STATIC_INLINE bool Cy_SysPm_Cm0IsActive(void);
__STATIC_INLINE bool Cy_SysPm_Cm0IsSleep(void);
__STATIC_INLINE bool Cy_SysPm_Cm0IsDeepSleep(void);
__STATIC_INLINE bool Cy_SysPm_Cm0IsLowPower(void);
__STATIC_INLINE bool Cy_SysPm_IsLowPower(void);

