ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syspm/cy_syspm.h
uint32_t Cy_SysPm_ReadStatus(void);
cy_en_syspm_status_t Cy_SysPm_Sleep(cy_en_syspm_waitfor_t enWaitFor);
cy_en_syspm_status_t Cy_SysPm_DeepSleep(cy_en_syspm_waitfor_t enWaitFor);
cy_en_syspm_status_t Cy_SysPm_Hibernate(void);
cy_en_syspm_status_t Cy_SysPm_EnterLpMode(void);
cy_en_syspm_status_t Cy_SysPm_ExitLpMode(void);
void Cy_SysPm_SleepOnExit(bool enable);

void Cy_SysPm_WakeupPinLevel(uint32_t pinNum, cy_en_syspm_pinstate_t enPinLevel);
void Cy_SysPm_WakeupLpCompLevel(uint32_t lpCompNum, cy_en_syspm_lpcomp_state_t enLpCompLevel);
void Cy_SysPm_WakeupWdt(bool configureWdt);
void Cy_SysPm_WakeupRtc(bool configureRtc);

bool Cy_SysPm_RegisterCallback(cy_stc_syspm_callback_t* handler);
bool Cy_SysPm_UnregisterCallback(cy_stc_syspm_callback_t* handler);
uint32_t Cy_SysPm_ExecuteCallback(cy_en_syspm_callback_type_t type,
                                  cy_en_syspm_callback_mode_t mode,
                                  uint32_t lastCallback);

bool Cy_SysPm_GetIoFreezeStatus(void);
void Cy_SysPm_IoFreeze(void);
void Cy_SysPm_IoUnfreeze(void);

void Cy_SysPm_LdoSetVoltage(cy_en_syspm_ldo_voltage_t voltage);
cy_en_syspm_ldo_voltage_t Cy_SysPm_LdoGetVoltage(void);
bool Cy_SysPm_LdoIsEnabled(void);

#if(0u != SRSS_SIMOBUCK_PRESENT)

    void Cy_SysPm_SwitchToSimoBuck(void);
    void Cy_SysPm_SimoBuckSetVoltage1(cy_en_syspm_simo_buck_voltage1_t voltage);
    cy_en_syspm_simo_buck_voltage1_t Cy_SysPm_SimoBuckGetVoltage1(void);

    void Cy_SysPm_EnableVoltage2(void);
    void Cy_SysPm_DisableVoltage2(void);
    void Cy_SysPm_SimoBuckSetVoltage2(cy_en_syspm_simo_buck_voltage2_t voltage);
    cy_en_syspm_simo_buck_voltage2_t Cy_SysPm_SimoBuckGetVoltage2(void);

    bool Cy_SysPm_SimoBuckOutputIsEnabled(cy_en_syspm_buck_out_t output);
    bool Cy_SysPm_SimoBuckIsEnabled(void);

    void Cy_SysPm_SimoBuckSetHwControl(bool hwControl);
    bool Cy_SysPm_SimoBuckGetHwControl(void);

#endif /* (0u != SRSS_SIMOBUCK_PRESENT) */


/*******************************************************************************
* Function Name: Cy_SysPm_Cm4IsActive
****************************************************************************//**
*
* Check if CM4 is in Active mode.
*
* \return
* true - if CM4 is in Active mode, false - if CM4 is not in Active mode.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysPm_Cm4IsActive(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM4_ACTIVE) != 0u);
}


/*******************************************************************************
* Function Name: Cy_SysPm_Cm4IsSleep
****************************************************************************//**
*
* Check if CM4 is in Sleep mode.
*
* \return
* true - if CM4 is in Sleep mode, false - if CM4 is not in Sleep mode.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysPm_Cm4IsSleep(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM4_SLEEP) != 0u);
}


/*******************************************************************************
* Function Name: Cy_SysPm_Cm4IsDeepSleep
****************************************************************************//**
*
* Check if CM4 is in DeepSleep mode.
*
* \return
* true - if CM4 is in DeepSleep mode, false - if CM4 is not in DeepSleep mode.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysPm_Cm4IsDeepSleep(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM4_DEEPSLEEP) != 0u);
}


/*******************************************************************************
* Function Name: Cy_SysPm_Cm4IsLowPower
****************************************************************************//**
*
* Check if CM4 is in LowPower mode.
*
* \return
* true - if CM4 is in LowPower mode, false - if CM4 is not in LowPower mode.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysPm_Cm4IsLowPower(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM4_LOWPOWER) != 0u);
}


/*******************************************************************************
* Function Name: Cy_SysPm_Cm0IsActive
****************************************************************************//**
*
* Check if CM0+ is in Active mode.
*
* \return
* true - if CM0+ is in Active mode, false - if CM0+ is not in Active mode.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysPm_Cm0IsActive(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM0_ACTIVE) != 0u);
}


/*******************************************************************************
* Function Name: Cy_SysPm_Cm0IsSleep
****************************************************************************//**
*
* Check if CM0+ is in Sleep mode.
*
* \return
* true - if CM0+ is in Sleep mode, false - if CM0+ is not in Sleep mode.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysPm_Cm0IsSleep(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM0_SLEEP) != 0u);
}


/*******************************************************************************
* Function Name: Cy_SysPm_Cm0IsDeepSleep
****************************************************************************//**
*
* Check if CM0+ is in DeepSleep mode.
*
* \return
* true - if CM0+ is in DeepSleep mode, false - if CM0+ is not in DeepSleep mode.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysPm_Cm0IsDeepSleep(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM0_DEEPSLEEP) != 0u);
}


/*******************************************************************************
* Function Name: Cy_SysPm_Cm0IsLowPower
****************************************************************************//**
*
* Check if CM0+ is in LowPower mode.
*
* \return
* true - if CM0+ is in LowPower mode, false - if CM0+ is not in LowPower mode.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysPm_Cm0IsLowPower(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM0_LOWPOWER) != 0u);
}


/*******************************************************************************
* Function Name: Cy_SysPm_IsLowPower
****************************************************************************//**
*
* Check if device is in Low Power mode.
*
* \return
* true - system is in Low Power mode,
* false - if system is is not in Low Power mode.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysPm_IsLowPower(void)
{
    return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_SYSTEM_LOWPOWER) != 0u);
}

#ifdef __cplusplus
}
#endif

#endif /* _CY_SYSPM_H_ */

/** \} group_syspm_functions*/
/** \} group_syspm */


/* [] END OF FILE */
